PostEpi/loraTracker/STM32Cube_FW_F1_V1.4.0/Drivers/BSP/STM3210C_LoraTracker/stm3210c_loraTracker.h
#define TIMx                           TIM3
#define TIMx_CLK_ENABLE()              __HAL_RCC_TIM3_CLK_ENABLE()


/* Definition for TIMx's NVIC */
#define TIMx_IRQn                      TIM3_IRQn
#define TIMx_IRQHandler                TIM3_IRQHandler
/**
  * @}
  */


/**
 * @brief output gpio
 */

#if defined(BSP_V500_TEST)
#define OUTGPIOn                          6

#define WDI_HOLD_PIN                    GPIO_PIN_0
#define WDI_HOLD_GPIO_PORT		          GPIOC
#define WDI_HOLD_GPIO_CLK_ENABLE()      __HAL_RCC_GPIOC_CLK_ENABLE()
#define WDI_HOLD_GPIO_CLK_DISBLE()      __HAL_RCC_GPIOC_CLK_DISABLE()

#define PS_HOLD_PIN                    	GPIO_PIN_1
#define PS_HOLD_GPIO_PORT              	GPIOC
#define PS_HOLD_GPIO_CLK_ENABLE()    		__HAL_RCC_GPIOC_CLK_ENABLE()
#define PS_HOLD_GPIO_CLK_DISABLE()    	__HAL_RCC_GPIOC_CLK_DISABLE()

#define WDE_PIN                    			GPIO_PIN_13
#define WDE_GPIO_PORT              			GPIOB
#define WDE_GPIO_CLK_ENABLE()    			  __HAL_RCC_GPIOB_CLK_ENABLE()
#define WDE_GPIO_CLK_DISABLE()    		  __HAL_RCC_GPIOB_CLK_DISABLE()

#define GPS_POWER_EN_PIN             		GPIO_PIN_1
#define GPS_POWER_EN_GPIO_PORT       		GPIOB
#define GPS_POWER_EN_CLK_ENABLE()  		  __HAL_RCC_GPIOB_CLK_ENABLE()
#define GPS_POWER_EN_CLK_DISABLE()  	  __HAL_RCC_GPIOB_CLK_DISABLE()

#define LORA_POWER_EN_PIN             	GPIO_PIN_3
#define LORA_POWER_EN_GPIO_PORT       	GPIOC
#define LORA_POWER_EN_CLK_ENABLE()  		__HAL_RCC_GPIOB_CLK_ENABLE()
#define LORA_POWER_EN_CLK_DISABLE()  		__HAL_RCC_GPIOB_CLK_DISABLE()

#define LORA_RESET_EN_PIN             	GPIO_PIN_2
#define LORA_RESET_EN_GPIO_PORT       	GPIOC
#define LORA_RESET_EN_CLK_ENABLE()  		__HAL_RCC_GPIOB_CLK_ENABLE()
#define LORA_RESET_EN_CLK_DISABLE()  		__HAL_RCC_GPIOB_CLK_DISABLE()


#define OUTPUTx_GPIO_CLK_ENABLE(__OUTPUTGPIO__) do { if ((__OUTPUTGPIO__) == OUTPUT_WDI) WDI_HOLD_GPIO_CLK_ENABLE()  ; else \
                                                 if ((__OUTPUTGPIO__) == OUTPUT_PS_HOLD) PS_HOLD_GPIO_CLK_ENABLE()  ; else \
                                                 if ((__OUTPUTGPIO__) == OUTPUT_WDE) WDE_GPIO_CLK_ENABLE()  ; else \
                                                 if ((__OUTPUTGPIO__) == OUTPUT_GPS_POWER) GPS_POWER_EN_CLK_ENABLE()  ; else \
                                                 if ((__OUTPUTGPIO__) == OUTPUT_LORA_POWER) LORA_POWER_EN_CLK_ENABLE()  ; else \
                                                 if ((__OUTPUTGPIO__) == OUTPUT_LORA_RESET) LORA_RESET_EN_CLK_ENABLE();} while(0)

#define OUTPUTx_GPIO_CLK_DISABLE(__OUTPUTGPIO__)    (((__OUTPUTGPIO__) == OUTPUT_WDI) WDI_HOLD_GPIO_CLK_DISBLE()  :\
                                                 ((__OUTPUTGPIO__) == OUTPUT_PS_HOLD) PS_HOLD_GPIO_CLK_DISABLE()  :\
                                                 ((__OUTPUTGPIO__) == OUTPUT_WDE) WDE_GPIO_CLK_DISABLE()  :\
                                                 ((__OUTPUTGPIO__) == OUTPUT_GPS_POWER) GPS_POWER_EN_CLK_DISABLE()  :\
                                                 ((__OUTPUTGPIO__) == OUTPUT_LORA_POWER) LORA_POWER_EN_CLK_DISABLE()  :\
                                                 ((__OUTPUTGPIO__) == OUTPUT_LORA_RESET) LORA_RESET_EN_CLK_DISABLE()  : 0 )
#else

#define OUTGPIOn                          3

#define WKUP_PIN                          GPIO_PIN_0
#define WKUP_GPIO_PORT		                GPIOA
#define WKUP_GPIO_CLK_ENABLE()            __HAL_RCC_GPIOA_CLK_ENABLE()
#define WKUP_GPIO_CLK_DISBLE()            __HAL_RCC_GPIOA_CLK_DISABLE()

#define NRST_PIN                    	    GPIO_PIN_1
#define NRST_GPIO_PORT              	    GPIOA
#define NRST_GPIO_CLK_ENABLE()    		    __HAL_RCC_GPIOA_CLK_ENABLE()
#define NRST_GPIO_CLK_DISABLE()    	      __HAL_RCC_GPIOA_CLK_DISABLE()

#define PRST_PIN                    			GPIO_PIN_0
#define PRST_GPIO_PORT              			GPIOB
#define PRST_GPIO_CLK_ENABLE()    			  __HAL_RCC_GPIOB_CLK_ENABLE()
#define PRST_GPIO_CLK_DISABLE()    		    __HAL_RCC_GPIOB_CLK_DISABLE()

#define OUTPUTx_GPIO_CLK_ENABLE(__OUTPUTGPIO__) do { if ((__OUTPUTGPIO__) == OUTPUT_WKUP) WKUP_GPIO_CLK_ENABLE()  ; else \
                                                 if ((__OUTPUTGPIO__) == OUTPUT_NRST) NRST_GPIO_CLK_ENABLE()  ; else \
                                                 if ((__OUTPUTGPIO__) == OUTPUT_PRST) PRST_GPIO_CLK_ENABLE();} while(0)

#define OUTPUTx_GPIO_CLK_DISABLE(__OUTPUTGPIO__)    (((__OUTPUTGPIO__) == OUTPUT_WKUP) WKUP_GPIO_CLK_DISBLE()  :\
                                                 ((__OUTPUTGPIO__) == OUTPUT_NRST) NRST_GPIO_CLK_DISABLE()  :\
                                                 ((__OUTPUTGPIO__) == OUTPUT_PRST) PRST_GPIO_CLK_DISABLE()  : 0 )

#endif


/** @addtogroup STM3210C_EVAL_BUTTON
  * @{
  */  
#define BUTTONn                          3

/**
 * @brief Tamper push-button
 */
#define TAMPER_BUTTON_PIN                   GPIO_PIN_13             /* PC.13*/
#define TAMPER_BUTTON_GPIO_PORT             GPIOC
#define TAMPER_BUTTON_GPIO_CLK_ENABLE()     __HAL_RCC_GPIOC_CLK_ENABLE()
#define TAMPER_BUTTON_GPIO_CLK_DISABLE()    __HAL_RCC_GPIOC_CLK_DISABLE()
#define TAMPER_BUTTON_EXTI_IRQn             EXTI15_10_IRQn

/**
 * @brief Key push-button
 */
#define KEY_BUTTON_PIN                      GPIO_PIN_9             /* PB.09*/
#define KEY_BUTTON_GPIO_PORT                GPIOB
#define KEY_BUTTON_GPIO_CLK_ENABLE()        __HAL_RCC_GPIOB_CLK_ENABLE()
#define KEY_BUTTON_GPIO_CLK_DISABLE()       __HAL_RCC_GPIOB_CLK_DISABLE()
#define KEY_BUTTON_EXTI_IRQn                EXTI9_5_IRQn

/**
 * @brief Wake-up push-button
 */
#define WAKEUP_BUTTON_PIN                   GPIO_PIN_0             /* PA.00*/
#define WAKEUP_BUTTON_GPIO_PORT             GPIOA
#define WAKEUP_BUTTON_GPIO_CLK_ENABLE()     __HAL_RCC_GPIOA_CLK_ENABLE()
#define WAKEUP_BUTTON_GPIO_CLK_DISABLE()    __HAL_RCC_GPIOA_CLK_DISABLE()
#define WAKEUP_BUTTON_EXTI_IRQn             EXTI0_IRQn

#define BUTTONx_GPIO_CLK_ENABLE(__BUTTON__) do { if ((__BUTTON__) == BUTTON_TAMPER) TAMPER_BUTTON_GPIO_CLK_ENABLE()  ; else \
                                                 if ((__BUTTON__) == BUTTON_KEY) KEY_BUTTON_GPIO_CLK_ENABLE()  ; else \
                                                 if ((__BUTTON__) == BUTTON_WAKEUP) WAKEUP_BUTTON_GPIO_CLK_ENABLE();} while(0)

