PostEpi/loraTracker/STM32Cube_FW_F1_V1.4.0/Drivers/BSP/STM3210C_LoraTracker/stm3210c_loraTracker.h
#define BUTTONx_GPIO_CLK_DISABLE(__BUTTON__)    (((__BUTTON__) == BUTTON_TAMPER) TAMPER_BUTTON_GPIO_CLK_DISABLE()  :\
                                                 ((__BUTTON__) == BUTTON_KEY) KEY_BUTTON_GPIO_CLK_DISABLE()  :\
                                                 ((__BUTTON__) == BUTTON_WAKEUP) WAKEUP_BUTTON_GPIO_CLK_DISABLE()  : 0 )

/**
  * @brief IO Pins definition 
  */ 
/* Joystick */
#define JOY_SEL_PIN                  (IO2_PIN_7) /* IO_Expander_2 */
#define JOY_DOWN_PIN                 (IO2_PIN_6) /* IO_Expander_2 */
#define JOY_LEFT_PIN                 (IO2_PIN_5) /* IO_Expander_2 */
#define JOY_RIGHT_PIN                (IO2_PIN_4) /* IO_Expander_2 */
#define JOY_UP_PIN                   (IO2_PIN_3) /* IO_Expander_2 */
#define JOY_NONE_PIN                 JOY_ALL_PINS
#define JOY_ALL_PINS                 (JOY_SEL_PIN | JOY_DOWN_PIN | JOY_LEFT_PIN | JOY_RIGHT_PIN | JOY_UP_PIN)

/* MEMS */
#define MEMS_INT1_PIN                (IO1_PIN_3) /* IO_Expander_1 */ /* Input */
#define MEMS_INT2_PIN                (IO1_PIN_2) /* IO_Expander_1 */ /* Input */
#define MEMS_ALL_PINS                (MEMS_INT1_PIN | MEMS_INT2_PIN)

#define AUDIO_RESET_PIN              (IO2_PIN_2) /* IO_Expander_2 */ /* Output */
#define MII_INT_PIN                  (IO2_PIN_0) /* IO_Expander_2 */ /* Output */
#define VBAT_DIV_PIN                 (IO1_PIN_0) /* IO_Expander_1 */ /* Output */

/**
  * @}
  */ 

/** @addtogroup STM3210C_EVAL_COM
  * @{
  */
#define COMn                             1

/**
 * @brief Definition for COM port1, connected to USART2
 */ 
#define EVAL_COM1                        USART1
#define EVAL_COM1_CLK_ENABLE()           __HAL_RCC_USART1_CLK_ENABLE()
#define EVAL_COM1_CLK_DISABLE()          __HAL_RCC_USART1_CLK_DISABLE()

#define AFIOCOM1_CLK_ENABLE()            __HAL_RCC_AFIO_CLK_ENABLE()
#define AFIOCOM1_CLK_DISABLE()           __HAL_RCC_AFIO_CLK_DISABLE()

#define EVAL_COM1_TX_PIN                 GPIO_PIN_9             /* PD.05*/
#define EVAL_COM1_TX_GPIO_PORT           GPIOA
#define EVAL_COM1_TX_GPIO_CLK_ENABLE()   __HAL_RCC_GPIOA_CLK_ENABLE()
#define EVAL_COM1_TX_GPIO_CLK_DISABLE()  __HAL_RCC_GPIOA_CLK_DISABLE()

#define EVAL_COM1_RX_PIN                 GPIO_PIN_10             /* PD.06*/
#define EVAL_COM1_RX_GPIO_PORT           GPIOA
#define EVAL_COM1_RX_GPIO_CLK_ENABLE()   __HAL_RCC_GPIOA_CLK_ENABLE()
#define EVAL_COM1_RX_GPIO_CLK_DISABLE()  __HAL_RCC_GPIOA_CLK_DISABLE()

#define EVAL_COM1_IRQn                   USART2_IRQn

#define COMx_CLK_ENABLE(__INDEX__)              do { if((__INDEX__) == COM1) EVAL_COM1_CLK_ENABLE();} while(0)
#define COMx_CLK_DISABLE(__INDEX__)             (((__INDEX__) == COM1) ? EVAL_COM1_CLK_DISABLE() : 0)

#define AFIOCOMx_CLK_ENABLE(__INDEX__)          do { if((__INDEX__) == COM1) AFIOCOM1_CLK_ENABLE();} while(0)
#define AFIOCOMx_CLK_DISABLE(__INDEX__)         (((__INDEX__) == COM1) ? AFIOCOM1_CLK_DISABLE() : 0)

#define AFIOCOMx_REMAP(__INDEX__)               (((__INDEX__) == COM1) ? (AFIO->MAPR |= (AFIO_MAPR_USART2_REMAP)) : 0)

#define COMx_TX_GPIO_CLK_ENABLE(__INDEX__)      do { if((__INDEX__) == COM1) EVAL_COM1_TX_GPIO_CLK_ENABLE();} while(0)
#define COMx_TX_GPIO_CLK_DISABLE(__INDEX__)     (((__INDEX__) == COM1) ? EVAL_COM1_TX_GPIO_CLK_DISABLE() : 0)

#define COMx_RX_GPIO_CLK_ENABLE(__INDEX__)      do { if((__INDEX__) == COM1) EVAL_COM1_RX_GPIO_CLK_ENABLE();} while(0)
#define COMx_RX_GPIO_CLK_DISABLE(__INDEX__)     (((__INDEX__) == COM1) ? EVAL_COM1_RX_GPIO_CLK_DISABLE() : 0)

/* ########################## hw definition ############################## */


#define LOG_USARTx                           USART1
#define LOG_USARTx_CLK_ENABLE()              __HAL_RCC_USART1_CLK_ENABLE();
#define LOG_USARTx_RX_GPIO_CLK_ENABLE()      __HAL_RCC_GPIOA_CLK_ENABLE()
#define LOG_USARTx_TX_GPIO_CLK_ENABLE()      __HAL_RCC_GPIOA_CLK_ENABLE()

#define LOG_USARTx_FORCE_RESET()             __HAL_RCC_USART1_FORCE_RESET()
#define LOG_USARTx_RELEASE_RESET()           __HAL_RCC_USART1_RELEASE_RESET()

/* Definition for USARTx Pins */
#define LOG_USARTx_TX_PIN                    GPIO_PIN_9
#define LOG_USARTx_TX_GPIO_PORT              GPIOA
#define LOG_USARTx_RX_PIN                    GPIO_PIN_10
#define LOG_USARTx_RX_GPIO_PORT              GPIOA


/* Definition for USARTx's DMA */
#define LOG_USARTx_TX_DMA_CHANNEL             DMA1_Channel4
#define LOG_USARTx_RX_DMA_CHANNEL             DMA1_Channel5

/* Definition for USARTx's NVIC */
#define LOG_USARTx_DMA_TX_IRQn                DMA1_Channel4_IRQn
#define LOG_USARTx_DMA_RX_IRQn                DMA1_Channel5_IRQn
#define LOG_USARTx_DMA_TX_IRQHandler          DMA1_Channel4_IRQHandler
#define LOG_USARTx_DMA_RX_IRQHandler          DMA1_Channel5_IRQHandler

/* Definition for USARTx's NVIC */
#define LOG_USARTx_IRQn                      USART1_IRQn
#define LOG_USARTx_IRQHandler                USART1_IRQHandler


/* Definition for USART2 clock resources */
#define LOR_USARTx                           USART2
#define LOR_USARTx_CLK_ENABLE()              __HAL_RCC_USART2_CLK_ENABLE();
#define LOR_DMAx_CLK_ENABLE()                __HAL_RCC_DMA1_CLK_ENABLE()
#define LOR_USARTx_RX_GPIO_CLK_ENABLE()      __HAL_RCC_GPIOD_CLK_ENABLE()
#define LOR_USARTx_TX_GPIO_CLK_ENABLE()      __HAL_RCC_GPIOD_CLK_ENABLE()

#define LOR_USARTx_FORCE_RESET()             __HAL_RCC_USART2_FORCE_RESET()
#define LOR_USARTx_RELEASE_RESET()           __HAL_RCC_USART2_RELEASE_RESET()

/* Definition for USARTx Pins */
#define LOR_USARTx_TX_PIN                    GPIO_PIN_2
#define LOR_USARTx_TX_GPIO_PORT              GPIOA
#define LOR_USARTx_RX_PIN                    GPIO_PIN_3
#define LOR_USARTx_RX_GPIO_PORT              GPIOA

/* Definition for USARTx's DMA */
#define LOR_USARTx_TX_DMA_CHANNEL             DMA1_Channel7
#define LOR_USARTx_RX_DMA_CHANNEL             DMA1_Channel6

/* Definition for USARTx's NVIC */
#define LOR_USARTx_DMA_TX_IRQn                DMA1_Channel7_IRQn
#define LOR_USARTx_DMA_RX_IRQn                DMA1_Channel6_IRQn
#define LOR_USARTx_DMA_TX_IRQHandler          DMA1_Channel7_IRQHandler
#define LOR_USARTx_DMA_RX_IRQHandler          DMA1_Channel6_IRQHandler

