PostEpi/loraTracker/STM32Cube_FW_F1_V1.4.0/Drivers/BSP/STM3210C_LoraTracker/stm3210c_loraTracker.h
/* Definition for USARTx's NVIC */
#define LOR_USARTx_IRQn                      USART2_IRQn
#define LOR_USARTx_IRQHandler                USART2_IRQHandler

/* Size of Trasmission buffer */
#define LOR_TXBUFFERSIZE                      (COUNTOF(lorTxBuffer) - 1)
/* Size of Reception buffer */
#define LOR_RXBUFFERSIZE                      10


  /* Definition for USART3 clock resources */
#define EXT_USARTx                           USART3
#define EXT_USARTx_CLK_ENABLE()              __HAL_RCC_USART3_CLK_ENABLE();
#define EXT_DMAx_CLK_ENABLE()                __HAL_RCC_DMA1_CLK_ENABLE()
#define EXT_USARTx_RX_GPIO_CLK_ENABLE()      __HAL_RCC_GPIOB_CLK_ENABLE()
#define EXT_USARTx_TX_GPIO_CLK_ENABLE()      __HAL_RCC_GPIOB_CLK_ENABLE()
  
#define EXT_USARTx_FORCE_RESET()             __HAL_RCC_USART3_FORCE_RESET()
#define EXT_USARTx_RELEASE_RESET()           __HAL_RCC_USART3_RELEASE_RESET()
  
  /* Definition for USARTx Pins */
#define EXT_USARTx_TX_PIN                    GPIO_PIN_10
#define EXT_USARTx_TX_GPIO_PORT              GPIOB
#define EXT_USARTx_RX_PIN                    GPIO_PIN_11
#define EXT_USARTx_RX_GPIO_PORT              GPIOB
  
  /* Definition for USARTx's DMA */
#define EXT_USARTx_TX_DMA_CHANNEL             DMA1_Channel2
#define EXT_USARTx_RX_DMA_CHANNEL             DMA1_Channel3
  
  /* Definition for USARTx's NVIC */
#define EXT_USARTx_DMA_TX_IRQn                DMA1_Channel2_IRQn
#define EXT_USARTx_DMA_RX_IRQn                DMA1_Channel3_IRQn
#define EXT_USARTx_DMA_TX_IRQHandler          DMA1_Channel2_IRQHandler
#define EXT_USARTx_DMA_RX_IRQHandler          DMA1_Channel3_IRQHandler
  
  /* Definition for USARTx's NVIC */
#define EXT_USARTx_IRQn                      USART3_IRQn
#define EXT_USARTx_IRQHandler                USART3_IRQHandler
  
  /* Size of Trasmission buffer */
#define EXT_TXBUFFERSIZE                      (COUNTOF(extTxBuffer) - 1)
  /* Size of Reception buffer */
#define EXT_RXBUFFERSIZE                      10


  /* Definition for UART4 clock resources  */
  // GPS_USARTx is using UART4
#define GPS_USARTx                           UART4
#define GPS_USARTx_CLK_ENABLE()              __HAL_RCC_UART4_CLK_ENABLE();
#define GPS_DMAx_CLK_ENABLE()                __HAL_RCC_DMA1_CLK_ENABLE()
#define GPS_USARTx_RX_GPIO_CLK_ENABLE()      __HAL_RCC_GPIOC_CLK_ENABLE()
#define GPS_USARTx_TX_GPIO_CLK_ENABLE()      __HAL_RCC_GPIOC_CLK_ENABLE()
  
#define GPS_USARTx_FORCE_RESET()             __HAL_RCC_UART4_FORCE_RESET()
#define GPS_USARTx_RELEASE_RESET()           __HAL_RCC_UART4_RELEASE_RESET()
  
  /* Definition for USARTx Pins */
#define GPS_USARTx_TX_PIN                    GPIO_PIN_10
#define GPS_USARTx_TX_GPIO_PORT              GPIOC
#define GPS_USARTx_RX_PIN                    GPIO_PIN_11
#define GPS_USARTx_RX_GPIO_PORT              GPIOC

#if 0  
  /* Definition for USARTx's DMA */
#define GPS_USARTx_TX_DMA_CHANNEL             DMA1_Channel3
#define GPS_USARTx_RX_DMA_CHANNEL             DMA1_Channel2
  
  /* Definition for USARTx's NVIC */
#define GPS_USARTx_DMA_TX_IRQn                DMA1_Channel3_IRQn
#define GPS_USARTx_DMA_RX_IRQn                DMA1_Channel2_IRQn
#define GPS_USARTx_DMA_TX_IRQHandler          DMA1_Channel3_IRQHandler
#define GPS_USARTx_DMA_RX_IRQHandler          DMA1_Channel2_IRQHandler
#endif

  /* Definition for USARTx's NVIC */
#define GPS_USARTx_IRQn                      UART4_IRQn
#define GPS_USARTx_IRQHandler                UART4_IRQHandler
  
  /* Size of Trasmission buffer */
#define GPS_TXBUFFERSIZE                      (COUNTOF(gpsTxBuffer) - 1)
  /* Size of Reception buffer */
#define GPS_RXBUFFERSIZE                      10



/* Exported macro ------------------------------------------------------------*/
#define COUNTOF(__BUFFER__)   (sizeof(__BUFFER__) / sizeof(*(__BUFFER__)))
/* Exported functions ------------------------------------------------------- */


/**
  * @}
  */ 

/** @addtogroup STM3210C_EVAL_BUS
  * @{
  */

/** 
  * @brief  IO Expander Interrupt line on EXTI  
  */ 
#define IOE_IT_PIN                       GPIO_PIN_14
#define IOE_IT_GPIO_PORT                 GPIOB
#define IOE_IT_GPIO_CLK_ENABLE()         __HAL_RCC_GPIOB_CLK_ENABLE()
#define IOE_IT_GPIO_CLK_DISABLE()        __HAL_RCC_GPIOB_CLK_DISABLE()
#define IOE_IT_EXTI_IRQn                 EXTI15_10_IRQn       
#define IOE_IT_EXTI_IRQHANDLER           EXTI15_10_IRQHandler

/* Exported constant IO ------------------------------------------------------*/
#define IO1_I2C_ADDRESS                       0x82
#define IO2_I2C_ADDRESS                       0x88
#define TS_I2C_ADDRESS                        0x82

/*The Slave ADdress (SAD) associated to the LIS302DL is 001110xb. SDO pad can be used 
to modify less significant bit of the device address. If SDO pad is connected to voltage 
supply LSb is �?�?(address 0011101b) else if SDO pad is connected to ground LSb value is 
�?�?(address 0011100b).*/
#define L1S302DL_I2C_ADDRESS                  0x38


/*##################### ACCELEROMETER ##########################*/
/* Read/Write command */
#define READWRITE_CMD                     ((uint8_t)0x80) 
/* Multiple byte read/write command */ 
#define MULTIPLEBYTE_CMD                  ((uint8_t)0x40)

/*##################### I2Cx ###################################*/
/* User can use this section to tailor I2Cx instance used and associated 
   resources */
/* Definition for I2Cx Pins */
#define EVAL_I2Cx_SCL_PIN                       GPIO_PIN_6        /* PB.06*/
#define EVAL_I2Cx_SCL_GPIO_PORT                 GPIOB
#define EVAL_I2Cx_SDA_PIN                       GPIO_PIN_7        /* PB.07*/
#define EVAL_I2Cx_SDA_GPIO_PORT                 GPIOB

/* Definition for I2Cx clock resources */
#define EVAL_I2Cx                               I2C1
#define EVAL_I2Cx_CLK_ENABLE()                  __HAL_RCC_I2C1_CLK_ENABLE()
#define EVAL_I2Cx_SDA_GPIO_CLK_ENABLE()         __HAL_RCC_GPIOB_CLK_ENABLE()
#define EVAL_I2Cx_SCL_GPIO_CLK_ENABLE()         __HAL_RCC_GPIOB_CLK_ENABLE() 

#define EVAL_I2Cx_FORCE_RESET()                 __HAL_RCC_I2C1_FORCE_RESET()
#define EVAL_I2Cx_RELEASE_RESET()               __HAL_RCC_I2C1_RELEASE_RESET()
    
/* Definition for I2Cx's NVIC */
#define EVAL_I2Cx_EV_IRQn                       I2C1_EV_IRQn
#define EVAL_I2Cx_EV_IRQHandler                 I2C1_EV_IRQHandler
#define EVAL_I2Cx_ER_IRQn                       I2C1_ER_IRQn
#define EVAL_I2Cx_ER_IRQHandler                 I2C1_ER_IRQHandler

